app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
  def index
    @articles = Article.all.order('created_at DESC')

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def current_user
      User.first