app/controllers/posts_controller.rb

    def current_user
      User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]